<?php
$welcome = 'سلام😃👋🏻'."\n\n".'من یک ربات مدیر گروهم با کلی امکانات عالی😁'."\n\n".'🌟 برای خرید و نصب من برای گروهتون'."\n\n".'🌀 اول بزن رو «خرید و نصب جدید»👇🏻'."\n\n".'🌀 دوم قوانین رو بخون و تایید بکن✌🏻'."\n\n".'🌀 سوم پلن هارو ببین رو یکی بزن و اینترنتی بخرش تا کد لایسنس بگیری👌🏻'."\n\n".'🌀بعد بیا منو اضافه کن گروهی که میخوای😊'."\n\n".'🌀بعدش منو ادمین گروهت بکن تا نصب بشم😉';
$rules = '☑️ شرایط و ضوابط:'."\n\n".'⚠️ خرید لایسنس به طور اتوماتیک و فقط با پرداخت از طریق درگاه اینترنتی قابل انجام است و به هیچ وجه از طریق شارژ سیم کارت و یا کارت به کارت امکان پذیر نیست.'."\n".'⚠️ با پرداخت هزینه و خرید لایسنس، ربات فقط در یک گروه فعال می‌شود و در صورت نیاز به عمل کردن ربات در ‌گروه های بیشتر ملزم​ به پرداخت هزینه و خرید طرح مربوطه خواهید بود.'."\n".'⚠️ هر زمان کاربر اقدام به نصب ربات در گروه خود بکند لایسنس از بین خواهد رفت و عمل نصب قابل بازگشت نخواهد بود. درضمن لایسنس فروخته شده تحت هیچ عنوان پس گرفته نخواهد شد.'."\n".'⚠️ رعایت ادب و احترام در تمامی مکالمات با تیم پشتیبانی ربات الزامیست. در صورت مشاهده هرنوع توهین و تهدید ٬ تیم پشتیبانی ربات می‌تواند بدون برگشت دادن مبلغی ربات را از گروه شما خارج کند.'."\n".'⚠️ مسئولیت محتوای گروه ‌هایی که توسط ربات جی پی لاکر محافظت می‌شود با مدیران آن گروه می‌باشد و به تیم پشتیبانی ربات ارتباطی ندارد و همچنین هیچ فردی جز مراجع قانونی حق دخالت در سیاست کاری جی پی لاکر نخواهد داشت.'."\n"."⚠️ ربات جی پی لاکر کاملاً تابع قوانین جمهوری اسلامی است و خود را ملزم به اجرای احکام ارسالی از سمت مراجع قضایی می‌داند"."\n".'⚠️ به هیچ وجه اعتبار ثبت شده برای گروهی قابل انتقال به گروه دیگری نیست. بنابراین جا به جایی ربات به هیچ وجه امکان پذیر نمی باشد.'."\n".'⚠️ در صورت مشاهده هر نوع عملکرد خرابکارانه توسط سرویس گیرنده برای آسیب رسانی به ربات ، تیم پشتیبانی ربات حق دارد ربات رو از گروه فرد مذکور خارج کند و همچنین مبلغی پس داده نمی‌شود.'."\n".'⚠️ در صورت پیدایش هر نوع اختلال در این شبکه مجازی اعم از فیلتر شدن تلگرام هیچ مبلغی پس داده نمی‌شود.'."\n".'⚠️ حق اعمال تغییرات در شرایط و ضوابط کاری در هر زمان برای جی پی لاکر محفوظ است و هر زمان که صلاح بداند می‌تواند تغییرات لازم را اعمال نماید و سرویس گیرنده صرف نظر از اینکه چه زمانی خرید انجام داده است ٬ موظف به رعایت قوانین جدید می‌باشد و ادعای عدم اطلاع وی از شرایط و ضوابط جدید تحت هیچ عنوان پذیرفته نمی‌شود.'."\n".'‼️ استفاده از خدمات ربات جی پی لاکر به معنای آگاهی، پذیرش و التزام به شرایط و ضوابط ربات از سوی کاربران است، بنابراین قوانین را با دقت مطالعه نمایید.';
if ($message_text == '/start'){
  req(
    'sendMessage',
    [
      'chat_id' => $chat_id,
      'text' => $welcome,
      'reply_markup' => inline_keyboard(
        // All array
        array(
          // line 1
          array(
            // obj 1
            array(
              'text' => 'خرید و نصب جدید', 'callback_data' => 'new_buy'
            )
          ),
          array(
            array(
              'text' => 'گروه های من', 'callback_data' => 'my_groups'
            )
          )
        )
        )
    ]
    );
}elseif($inline_button_data == 'home'){
      req(
    'editMessageText',
    [
      'chat_id' => $chat_id,
      'message_id' => $inline_message_id,
      'text' => $welcome,
      'reply_markup' => inline_keyboard(
        // All array
        array(
          // line 1
          array(
            // obj 1
            array(
              'text' => 'خرید و نصب جدید', 'callback_data' => 'new_buy'
            )
          ),
          array(
            array(
              'text' => 'گروه های من', 'callback_data' => 'my_groups'
            )
          )
        )
        )
    ]
    );
}elseif ($inline_button_data == 'new_buy'){
  req('editMessageText',[
    'chat_id' => $chat_id,
    'message_id' => $inline_message_id,
    'text' => $rules,
    'reply_markup' => inline_keyboard(
      array(
        array(
          array(
            'text' => 'بازگشت','callback_data' => 'home'
          ),array(
            'text' => 'پذیرش','callback_data' => 'accept'
          )
        )
      )
    )
  ]);
}elseif ($inline_button_data == 'accept'){
  include './pv/user/order.php';
}
?>
